{
  "name": "Duc Le",
  "main role": "AI Engineer",
  "roles": [
    "Research Scientist",
    "Machine Learning Engineer",
    "Prompting Engineer",
    "AI Product Manager",
    "Data Scientist",
    "MLOps Engineer"
  ],
  "bio": "I am a passionate researcher and developer specializing in machine learning and computer vision. With a background in computer science and artificial intelligence, I am dedicated to advancing the field of AI and making it more accessible to everyone.\n\nMy research interests include deep learning, computer vision, and natural language processing. I am particularly excited about the intersection of AI and healthcare, where I believe significant innovations can occur.\n\nWhen I'm not coding or researching, you can find me reading scientific papers, contributing to open-source projects, or exploring new technologies.",
  "image": "/images/Duc_Le.jpg",
  "location": "Ha Noi Capital, Vietnam",
  "email": "lengocduc195@example.com",
  "social": {
    "github": "https://github.com/lengocduc195",
    "linkedin": "https://linkedin.com/in/david-ducle",
    "twitter": "https://twitter.com/david-ducle",
    "googleScholar": "https://scholar.google.com/citations?user=ABC123",
    "orcid": "https://orcid.org/0000-0000-0000-0000"
  },
  "cv": {
    "url": "/assets/cv/Duc_Le_CV.pdf",
    "filename": "Duc_Le_CV.pdf"
  },
  "resume": {
    "url": "/assets/cv/Duc_Le_resume.pdf",
    "filename": "Duc_Le_resume.pdf"
  },
  "education": [
    {
      "degree": "Bachelor of Technology (BTech), Honors Program",
      "school": "VNUHCM - University of Science",
      "year": "Sep 2020 - Dec 2024",
      "description": "Extensive experience in Explainable AI (XAI), trustworthy AI, and management, particularly in risk detection in the medical field. Expertise in Federated Learning and security. Activities: Volleyball, badminton, karate. Grade: 8.6."
    }
  ],
  "experience": [
    {
      "title": "AI Lead",
      "company": "Secomus Technology",
      "period": "May 2025 - Present",
      "description": "Leading AI initiatives from strategy to deployment. Key contributions include: \n- Developing intelligent Chatbots to automate support and boost engagement.\n- Building customer intelligence platforms for actionable insights.\n- Architecting AI Agent systems for enterprise database management.\n- Driving AI research to enhance efficiency and business growth."
    },
    {
      "title": "AI Engineer",
      "company": "Secomus Technology",
      "period": "Mar 2025 - May 2025",
      "description": "Designed and delivered AI-powered solutions with impact on core business goals, including Chatbots, customer intelligence platforms, and AI Agents for enterprise data access."
    },
    {
      "title": "AI Researcher",
      "company": "Computer Science Lab - HCMUS",
      "period": "Jun 2023 - Present",
      "description": "Mentored research in Explainable AI for Computer Vision. Focused on interpretability techniques and evaluation methods, bridging NLP and Computer Vision."
    },
    {
      "title": "AI Researcher",
      "company": "AI VIET NAM",
      "period": "Oct 2023 - Mar 2024",
      "description": "Developed and evaluated Vietnamese LLMs, improving understanding, generation, and cultural adaptation."
    }
  ],
  "slogan": "I believe one good line of code can change how we think."
}